[
  {"Flashcard": "1", "Term": "HTML", "Definition": "HyperText Markup Language, the standard markup language used to create web pages."},
  {"Flashcard": "2", "Term": "CSS", "Definition": "Cascading Style Sheets, used to style and layout web pages."},
  {"Flashcard": "3", "Term": "JavaScript", "Definition": "A high-level, interpreted programming language that is a core technology of the World Wide Web."},
  {"Flashcard": "4", "Term": "Front-End", "Definition": "The client side of a web application, typically consisting of HTML, CSS, and JavaScript."},
  {"Flashcard": "5", "Term": "Back-End", "Definition": "The server side of a web application, responsible for managing data, server requests, and more."},
  {"Flashcard": "6", "Term": "Web Server", "Definition": "A system that stores, processes, and delivers web pages to users."},
  {"Flashcard": "7", "Term": "HTTP", "Definition": "Hypertext Transfer Protocol, the protocol used for transferring data over the web."},
  {"Flashcard": "8", "Term": "URL", "Definition": "Uniform Resource Locator, the address used to access web resources."},
  {"Flashcard": "9", "Term": "SEO", "Definition": "Search Engine Optimization, the practice of increasing the quantity and quality of traffic to your website through organic search engine results."},
  {"Flashcard": "10", "Term": "API", "Definition": "Application Programming Interface, a set of rules that allow programs to talk to each other."},
  {"Flashcard": "11", "Term": "JSON", "Definition": "JavaScript Object Notation, a format for structuring data."},
  {"Flashcard": "12", "Term": "Responsive Web Design", "Definition": "An approach to web design that makes web pages render well on a variety of devices and window or screen sizes."},
  {"Flashcard": "13", "Term": "Browser Developer Tools", "Definition": "A set of tools built into modern browsers that developers can use to probe and experiment with web pages."},
  {"Flashcard": "14", "Term": "Git", "Definition": "A distributed version control system for tracking changes in source code during software development."},
  {"Flashcard": "15", "Term": "GitHub", "Definition": "A web-based hosting service for version control and collaboration using Git."},
  {"Flashcard": "16", "Term": "Command Line Interface", "Definition": "A text-based user interface to a computer's operating system."},
  {"Flashcard": "17", "Term": "npm", "Definition": "Node Package Manager, a package manager for the JavaScript programming language."},
  {"Flashcard": "18", "Term": "Yarn", "Definition": "A package manager for the JavaScript programming language that helps to manage project dependencies."},
  {"Flashcard": "19", "Term": "Node.js", "Definition": "A platform built on Chrome's JavaScript runtime for building fast and scalable network applications."},
  {"Flashcard": "20", "Term": "Express.js", "Definition": "A minimal and flexible Node.js web application framework that provides a robust set of features for web and mobile applications."},
  {"Flashcard": "21", "Term": "REST", "Definition": "Representational State Transfer, an architectural style for designing networked applications."},
  {"Flashcard": "22", "Term": "Database", "Definition": "A structured set of data stored and organized in a way that allows for efficient retrieval, modification, and deletion of the data."},
  {"Flashcard": "23", "Term": "SQL", "Definition": "Structured Query Language, a programming language used to communicate with and manipulate databases."},
  {"Flashcard": "24", "Term": "NoSQL", "Definition": "A non-relational database that provides a mechanism for storage and retrieval of data modeled in means other than tabular relations used in relational databases."},
  {"Flashcard": "25", "Term": "DOM", "Definition": "Document Object Model, a programming interface for web documents."},
  {"Flashcard": "26", "Term": "Event", "Definition": "An action or occurrence recognized by a program that may be handled by the program."},
  {"Flashcard": "27", "Term": "AJAX", "Definition": "Asynchronous JavaScript and XML, a set of web development techniques for creating asynchronous web applications."},
  {"Flashcard": "28", "Term": "Responsive Images", "Definition": "The practice of delivering optimized images to users based on their device capabilities and screen size."},
  {"Flashcard": "29", "Term": "Browser Compatibility", "Definition": "The ability of a website or web application to function across different web browsers."},
  {"Flashcard": "30", "Term": "Debugging", "Definition": "The process of finding and resolving errors or issues in code."},
  {"Flashcard": "31", "Term": "Front-End Framework", "Definition": "A collection of pre-written, standardized code that facilitates the development of web applications."},
  {"Flashcard": "32", "Term": "Back-End Framework", "Definition": "A collection of pre-written, standardized code that facilitates the development of server-side applications."},
  {"Flashcard": "33", "Term": "Single Page Application", "Definition": "A web application or website that interacts with the user by dynamically rewriting the current web page with new data from the web server."},
  {"Flashcard": "34", "Term": "User Experience (UX)", "Definition": "The overall experience a user has when interacting with a product or system, especially in terms of how easy or pleasing it is to use."},
  {"Flashcard": "35", "Term": "User Interface (UI)", "Definition": "The means by which a user interacts with a computer or other electronic device."},
  {"Flashcard": "36", "Term": "Authentication", "Definition": "The process of verifying the identity of a user or system."},
  {"Flashcard": "37", "Term": "Authorization", "Definition": "The process of granting or denying access to resources or services based on user identity and permissions."},
  {"Flashcard": "38", "Term": "Session Management", "Definition": "The process of securely managing user interactions with a web application across multiple requests and responses."},
  {"Flashcard": "39", "Term": "Encryption", "Definition": "The process of encoding information in such a way that only authorized parties can access it."},
  {"Flashcard": "40", "Term": "Cross-Site Scripting (XSS)", "Definition": "A security vulnerability that allows attackers to inject malicious scripts into web pages viewed by other users."},
  {"Flashcard": "41", "Term": "Cross-Site Request Forgery (CSRF)", "Definition": "A security vulnerability that allows an attacker to exploit the trust that a website has for a user's browser."},
  {"Flashcard": "42", "Term": "Scalability", "Definition": "The ability of a system to handle growing amounts of work in a graceful manner."},
  {"Flashcard": "43", "Term": "Performance Optimization", "Definition": "The process of improving the speed and efficiency of a web application."},
  {"Flashcard": "44", "Term": "Responsive Design", "Definition": "An approach to web design that aims to make web pages render well on a variety of devices and window or screen sizes."},
  {"Flashcard": "45", "Term": "Progressive Web App (PWA)", "Definition": "A type of application software delivered through the web, built using common web technologies like HTML, CSS, and JavaScript."},
  {"Flashcard": "46", "Term": "Web Accessibility", "Definition": "The practice of ensuring that websites and web applications are usable by people of all abilities and disabilities."},
  {"Flashcard": "47", "Term": "Performance Metrics", "Definition": "Measurements used to evaluate the performance of a web application, such as page load time, response time, and resource utilization."},
  {"Flashcard": "48", "Term": "Continuous Integration (CI)", "Definition": "The practice of regularly merging code changes from multiple developers into a shared repository."},
  {"Flashcard": "49", "Term": "Continuous Deployment (CD)", "Definition": "The practice of automatically deploying code changes to production environments after passing automated tests."},
  {"Flashcard": "50", "Term": "Content Delivery Network (CDN)", "Definition": "A distributed network of servers that deliver web content to users based on their geographic location, server availability, and performance metrics."}
]
